In [2]:
import numpy as np
import pandas as pd

In [4]:
population_data = pd.read_csv('Cleaned Datasets/cleaned_population_data.csv')
population_data

,Unnamed: 0,Country,Region,GENC,Year,Area in Square Kilometers,Population,Male Population,Female Population,Annual Growth Rate %,...,"Age 1-4 Mortality, Both Sexes","Age 1-4 Mortality, Males","Age 1-4 Mortality, Females","Under Age 5 Mortality, Both Sexes","Under Age 5 Mortality, Males","Under Age 5 Mortality, Females",Crude Death Rate,"Deaths, both sexes",Net Migration Rate,"Net international migrants, both sexes"
0,1,AFGHANISTAN,"1950,Afghanistan",AF,1950,652230,8150368,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,ALBANIA,"1950,Albania",AL,1950,27398,1227156,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,ALGERIA,"1950,Algeria",DZ,1950,2381740,8892718,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,AMERICAN SAMOA,"1950,American Samoa",AS,1950,198,19100,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,ANDORRA,"1950,Andorra",AD,1950,468,6176,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16719,16867,WALLIS AND FUTUNA,"2023,Wallis and Futuna",WF,2023,142,15929,8184.0,7745.0,0.23,...,0.5,0.5,0.5,4.4,4.3,4.5,5.9,94.0,-3.8,-61.0
16720,16868,WEST BANK,"2023,West Bank",XW,2023,5640,3176549,1614609.0,1561940.0,2.10,...,3.0,3.4,2.7,19.1,22.0,15.9,3.5,11058.0,-3.9,-12271.0
16721,16869,YEMEN,"2023,Yemen",YE,2023,527968,31565602,15935821.0,15629781.0,1.83,...,15.7,16.2,15.2,60.5,66.2,54.6,5.5,175014.0,-0.2,-5898.0
16722,16870,ZAMBIA,"2023,Zambia",ZM,2023,743398,20216029,10114935.0,10101094.0,2.86,...,16.6,17.4,15.7,52.3,56.5,48.0,6.0,121638.0,0.2,3144.0
16723,16871,ZIMBABWE,"2023,Zimbabwe",ZW,2023,386847,16819805,8179593.0,8640212.0,1.99,...,15.2,15.7,14.7,48.7,52.8,44.4,6.7,112296.0,-2.9,-47935.0

In [23]:
education_2017 = pd.read_csv('Cleaned Datasets/CleanedEducationData1870_2017.csv')
education_2017

          Country Code  Year  avg_years_of_schooling
0     AFGHANISTAN  AFG  1870                    0.01
1     AFGHANISTAN  AFG  1875                    0.01
2     AFGHANISTAN  AFG  1880                    0.01
3     AFGHANISTAN  AFG  1885                    0.01
4     AFGHANISTAN  AFG  1890                    0.01
...           ...  ...   ...                     ...
7758     ZIMBABWE  ZWE  2013                    8.00
7759     ZIMBABWE  ZWE  2014                    8.20
7760     ZIMBABWE  ZWE  2015                    8.20
7761     ZIMBABWE  ZWE  2016                    8.20
7762     ZIMBABWE  ZWE  2017                    8.20

[7763 rows x 4 columns]

In [22]:
education_2021 = pd.read_csv('Cleaned Datasets/CleanedEducationData1990_2021.csv')
education_2021

          Country  Year  avg_years_of_schooling
0     AFGHANISTAN  1990                   0.971
1         ALBANIA  1990                   7.355
2         ALGERIA  1990                   4.615
3         ANDORRA  1990                     NaN
4          ANGOLA  1990                     NaN
...           ...   ...                     ...
5979    VENEZUELA  2021                  11.110
5980      VIETNAM  2021                   8.370
5981        YEMEN  2021                   3.200
5982       ZAMBIA  2021                   7.187
5983     ZIMBABWE  2021                   8.711

[5984 rows x 3 columns]

In [10]:
world_gdp = pd.read_csv('Cleaned Datasets/World_GDP_cleaned.csv')
world_gdp

                           Country  Year           GDP
0                            ARUBA  1960           NaN
1      AFRICA EASTERN AND SOUTHERN  1960  1.847810e+10
2                      AFGHANISTAN  1960  5.377778e+08
3       AFRICA WESTERN AND CENTRAL  1960  1.041165e+10
4                           ANGOLA  1960           NaN
...                            ...   ...           ...
16753                       KOSOVO  2022  9.409474e+09
16754                  YEMEN, REP.  2022           NaN
16755                 SOUTH AFRICA  2022  4.052709e+11
16756                       ZAMBIA  2022  2.916378e+10
16757                     ZIMBABWE  2022  2.736663e+10

[16758 rows x 3 columns]

In [52]:
# data_education = pd.merge(education_2017, education_2021, on=['Country', 'Year'], how='outer', indicator=True)

# data_education[(data_education['Year'] == 2000) * (data_education['_merge'] != 'both')]
# data1 = pd.merge(population_data, data_education, how='outer')

data = pd.merge(education_2017, world_gdp, on=['Country', 'Year'],how='outer', indicator=True)
data[(data['Year'] == 2000)*(data['_merge'] != 'both')]

,Country,Code,Year,avg_years_of_schooling,GDP,_merge
426,BAHAMAS,BHS,2000,10.9,NaN,left_only
952,BRUNEI,BRN,2000,8.3,NaN,left_only
1232,CAPE VERDE,CPV,2000,3.5,NaN,left_only
1492,CONGO,COG,2000,5.5,NaN,left_only
1840,DEMOCRATIC REPUBLIC OF CONGO,COD,2000,3.3,NaN,left_only
...,...,...,...,...,...,...
16435,VIET NAM,NaN,2000,NaN,3.117252e+10,right_only
16436,VANUATU,NaN,2000,NaN,2.720146e+08,right_only
16437,WORLD,NaN,2000,NaN,3.389897e+13,right_only
16438,KOSOVO,NaN,2000,NaN,NaN,right_only
16439,"YEMEN, REP.",NaN,2000,NaN,9.679317e+09,right_only